# vsoStateGetLayrChng

## Description
Used to determine if the layer scale have changed. See [[VS:Parametric State Notifications#vsoStateGetLayrChng]]

This function should be called during the parametric reset event: <code>3: {kParametricRecalculate}</code>

```pascal
FUNCTION vsoStateGetLayrChng(
				hObj             : HANDLE;
				VAR outOldScale  : REAL;
				VAR outNewScale  : REAL;
				VAR outScaleText : BOOLEAN): BOOLEAN;
```

```python
def vs.vsoStateGetLayrChng(hObj):
    return (BOOLEAN, outOldScale, outNewScale, outScaleText)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|Handle to the parametric object. Obtained by call to GetCustomObjectInfo|
|outOldScale|REAL|Output parameter. Old layer scale.|
|outNewScale|REAL|Output parameter. New layer scale.|
|outScaleText|BOOLEAN|Output parameter. Does the new scale affect texts.|

## Examples
#### VectorScript ####
```pascal
BEGIN
  result := GetCustomObjectInfo(objectName, objectHand, recordHand, wallHand);
  vsoGetEventInfo(theEvent, message );

  CASE theEvent OF
    5: {kObjOnInitXProperties}
    BEGIN
      {enable eventing for this plug-in}
      SetPrefInt( 590, 1 ); {varParametricEnableStateEventing, kParametricStateEvent_ResetStatesEvent}
      result := SetObjPropVS(18, TRUE); {kObjXPropAcceptStates}
      result := SetObjPropVS( 2, TRUE ); {kObjXPropHasLayerScaleDeps}
    END;

    44: {kObjOnAddState}
    BEGIN
      message := vsoStateAddCurrent( objectHand, message );
    END;

    3: {kParametricRecalculate}
    BEGIN
      MoveTo( 5mm, 8mm );
      CreateText( 'State events received after the last kParametricRecalculate:' );

      IF vsoStateGetLayrChng( objectHand, oldScale, newScale, scaleText ) THEN BEGIN
        MoveTo( 0,-60mm );
        CreateText( Concat( 'Layer changed! oldScale=', oldScale, ' newScale=', newScale, ' scaleText=', scaleText ) );
      END;
    END;
```
#### Python ####
```python

```

```pascal
BEGIN
	{ XXX Bobi: check fayer change (scaled, elevation changed, height changed).
	  IF so make a fake move OF the object. }
	IF vsoStateGetLayrChng( objHand, fakeOldLayerVal, fakeNewLayerVal, fakeLayerTextBool ) THEN BEGIN
		HMove( objHand, 0, 0 ); { fake move. }
	END;

BEGIN
	IF vsoStateGetLayrChng( parmHand, oldScale, newScale, scaleText ) THEN
		BEGIN
		IF (oldScale <> newScale) THEN
			BEGIN
			rawLineLength := Str2Num(GetRField(parmHand,parmName,'LineLength'));
			newLineLength := rawLineLength*(newScale/oldScale);
			SetRField(parmHand,parmName,'LineLength',Concat(newLineLength));
			END;

{//////// Scale Header and Title text if regen by layer change and Scale Text TRUE ////////}
IF vsoStateGetLayrChng(PIHan, outOldScale, outNewScale, outScaleText) & outScaleText THEN BEGIN
	key.headerTextAtts.size := key.headerTextAtts.size / outNewScale * outOldScale;
	key.titleTextAtts.size := key.titleTextAtts.size / outNewScale * outOldScale;
	SetRField(PIHan, PIName, 'headerSize', Concat(key.headerTextAtts.size));
	SetRField(PIHan, PIName, 'TitleSize', Concat(key.titleTextAtts.size));
END;
```
```python
result = vs.vsoStateGetLayrChng(h)
```

## See Also
Parametric State Notifications | vsoStateAddCurrent

vsoStateGetPos | vsoStateGetRot | vsoStateGetParamChng | vsoStateGetObjChng | vsoStateGetLayrChng | vsoStateGetExitGroup | vsoStateGetNameChng

## Version
Availability: from Vectorworks 2009

This is drop-in function.

## Category
* Object Events